## Crawl 해올 데이터 ##
'''

ArticleNumber
    - ...
url
    - url 주소 저장
[Document]
    - url 주소를 저장한다면 따로 본문을 저장할 필요가 있을까?
postdate
    - 게시 일자
Expiredate
    - 만료 일자
Classification
    - 학사, 비교과, 장학, 학술, 입학, 취업, 사무, 기타, 행사, 파란학기제, 학사일정
Board
    - Aims2 (학사/비교과/장학/학술/입학/취업/사무/기타/행사/파란학기제/학사일정)
    - 아주허브 > 비교과신청 > 진행중항목(비교과)
    - 아주허브 > 취업지원 > 학습활동(비교과)
    - 아주허브 > 채용정보 > 일반채용정보(취업)
    - 아주허브 > 취업지원 > 종합게시판(취업)
    - 커뮤니티 > 공지사항(기타)
    - 일자리센터 > 채용정보(취업)
    - 일자리센터 > 카드뉴스(취업)
    - 일자리센터 > 뉴스레터(취업)
    - 일자리센터 > 뉴스앤잡 취업/창업 뉴스(취업)
    - 일자리센터 > 잡코리아 신입공채(취업)
    - 일자리센터 > 커뮤니티 > 교내프로그램(취업)
    - 일자리센터 > 커뮤니티 > 교외프로그램(취업)
    - 일자리센터 > 워크넷 연계서비스 > 공채속보(취업)
    - 각 단과 대학
        - 정보통신대학 > 커뮤니티 > 공지사항 (학사/비교과/장학/학술/입학/취업/사무/기타/행사/파란학기제/학사일정 : http://eng.ajou.ac.kr/eng/community/notice.jsp)
            - 기계공학과 > 게시판 > 학과공지 (학사/비교과/장학/학술/입학/취업/사무/기타/행사/파란학기제/학사일정 : http://eng.ajou.ac.kr/me/board/board01.jsp)
            - 산업공학과 > 학사행정 > 공지사항 (학사/비교과/장학/학술/입학/취업/사무/기타/행사/파란학기제/학사일정 : http://eng.ajou.ac.kr/ie/board/board01.jsp)
            - 화학공학과 > 커뮤니티 > 학과공지 (학사/비교과/장학/학술/입학/취업/사무/기타/행사/파란학기제/학사일정 : http://eng.ajou.ac.kr/che/community/community03.jsp)
            - 신소재공학과 > 게시판 > 학과공지 (학사/비교과/장학/학술/입학/취업/사무/기타/행사/파란학기제/학사일정 : http://eng.ajou.ac.kr/mse/board/board03.jsp)
            - ....
'''

## 1. portal